Revit 2024 API
InitialColor Class
 This class is the base class for calculating initial light color.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class InitialColor : IDisposable
Visual Basic
Public Class InitialColor _
	Implements IDisposable
Visual C++
public ref class InitialColor : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.CustomInitialColor
 Autodesk.Revit.DB.Lighting.PresetInitialColor
See Also
InitialColor Members
Autodesk.Revit.DB.Lighting Namespace